[
    {
        "brand": "Ferrari",
        "brandLogo": "https://listcarbrands.com/wp-content/uploads/2015/12/Ferrari-Logo-960x540.png",
        "model": "Roma",
        "modelImage": "https://www.kimballstock.com/pix/car/p/07/frr-04-rk0788-01p.jpg",
        "description": "The heart of the Ferrari Roma consists of a 3.9-liter twin-turbo engine with 620 HP available between 5,750 and 7,500 rpm and 760 Nm of torque between 3,000 and 5,750 rpm. Boasting the same power as the Portofino M, the Ferrari Roma also integrates the new eight-speed dual-clutch automatic transmission, 23% faster than that of the Portofino. With a mass of 1,472 kg, the Ferrari Roma is capable of accelerating from 0 to 100 km/h in just 3.4 seconds and reaching a peak speed of 320 km/h. Finally, traction is strictly rear, like a true super sports car. The Ferrari Roma price list does not include specific configurations, but the customization possibilities are countless. Options include external carbon components, 6 types of matt and glossy rims including the glossy Brilliant Silver forged ones, brake calipers in five aluminum colours, three exhaust tailpipe options including the sporty ones and the black ceramic ones, dove gray interiors, series as an alternative to the Daytona or those with diamond stitching, many colors for the interior and stitching options including carbon ones, passenger display, mats with embroidered logo, aluminum driver & pass.footrest footrests.",
        "year": 2021,
        "price": 205737,
        "available": false
    },
    {
        "brand": "Ferrari",
        "brandLogo": "https://listcarbrands.com/wp-content/uploads/2015/12/Ferrari-Logo-960x540.png",
        "model": "Ferrari 812 Superfast Mansory Red",
        "modelImage": "https://www.kimballstock.com/pix/car/p/07/frr-04-rk0785-01p.jpg",
        "description":"The third generation of a fully refined Ferrari gran turismo is defined by lightweight bodywork components made of visible carbon fibre and several engine modifications, making this stallion an untamed beast. The fierce red color is synonymous with fast super sports cars, the interior color was therefore a clear choice. With the finest quality materials ranging from carbon fibres to traditionally handcrafted leather, the interior oozes pure luxury. The sports steering wheel designed especially for the Ferrari 812 and the aluminium pedals guarantee full control over the vehicle. In the quest for the ultimate sports experience, we have made some upgrades to the 6.5 litre V12 engine. Resulting from the optimisation of series electronics in combination with a great-sounding sports exhaust system, the engine performance of the 812 Superfast has been increased to 830hp/611kW.",
        "year": 2022,
        "price": 300000,
        "available": true
    },
    {
        "brand": "Ferrari",
        "brandLogo": "https://listcarbrands.com/wp-content/uploads/2015/12/Ferrari-Logo-960x540.png",
        "model": "Ferrari Mansory 458 Italia Siracusa Red",
        "modelImage": "https://www.kimballstock.com/pix/car/p/06/frr-04-rk0683-01p.jpg",
        "description":"Ferrari 458 Italia was absolutely new in all aspects. Each single aerodynamic design element of the surface is manufactured in first-class quality and is exactly fitted to the automobile. We present to you the perfect symbiosis between dynamic functionality and luxurious ambience. The interior is equipped with the most precious materials such as the finest leather, Alcantara and exposed carbon. Sports seats, newly designed centre console and sports steering wheel with a switch panel provide the perfect fast-driving experience together with the aluminium pedals. We have improved the engine performance, but also the car's acceleration. As a result of an optimized engine management system, a sports air filter, and a sports exhaust system, the car accelerates in breathtaking 3.2 seconds from 0 to 100 km/h. The top speed is 330 km/h, also higher than the basic Ferrari model.",
        "year": 2011,
        "price": 780000,
        "available": true
    },
    {
        "brand": "Lamborghini",
        "brandLogo": "https://listcarbrands.com/wp-content/uploads/2016/03/logo-Lamborghini-768x307.png",
        "model": "Lamborghini Countach LPI 800-4 White",
        "modelImage": "https://www.kimballstock.com/pix/car/p/07/lam-01-rk0960-01p.jpg",
        "description":"Fifty years after its presentation at the Geneva Motor Show, the legendary Lamborghini Countach returns as a protagonist with a limited hybrid series that celebrates the visionary design that has forever revolutionized the panorama of modern super sports cars, laying the foundations of Lamborghini's heritage. This is the new Countach LPI 800-4. Inspired by the past but with a vocation for the future. Perfect proportions, futuristic style. The disruptive concept behind the bold silhouette that inspired generations of super sports cars lives again in this celebratory version of just 112 units. The pure lines, the rear longitudinal position of the V12 and the iconic scissor doors, whose new design reinterprets their shapes with an even clearer cut, make it immediately recognizable while projecting it into the future. Exclusive configurations have been created to preserve its unique DNA, such as the solid heritage colors Giallo Countach and Impact White, or the contemporary, mainly metallic colors, such as Viola Pasifae and Blu Uranus. Equipped with the same incredible hybrid powertrain as the Sián FKP 37 and Sián Roadster, the new Countach LPI 800-4 sports a 780 HP (574 kW) combustion engine capable of offering the same unique performance as Lamborghini's naturally aspirated V12s.",
        "year": 2022,
        "price": 2440000,
        "available": false
    },
    {
        "brand": "Lamborghini",
        "brandLogo": "https://listcarbrands.com/wp-content/uploads/2016/03/logo-Lamborghini-768x307.png",
        "model": "Lamborghini Aventador Ultimae LP 780-4 Blue",
        "modelImage": "https://www.kimballstock.com/pix/car/p/07/lam-01-rk0966-01p.jpg",
        "description":"Imagine a super sports car in which the most advanced technological solutions and the incomparable Aventador design merge together with the thrill of open-air driving: a pure, adrenaline-filled experience. With a production of only 250 units, the Aventador 780-4 Ultimae Roadster is the newest—and final—open-top version of a legendary family. Its 780 CV V12, the latest and most powerful standard-production, naturally aspirated engine in Lamborghini history, makes this model the most iconic of the Aventador range. The Roadster’s Lamborghini DNA is unmistakable, with even sharper lines and a perfect contrast of sophistication and aggression: a design masterpiece in which aesthetic and practical perfection is no longer just an ideal. The removable hardtop, made using an innovative high-pressure RTM molding technology, ensures strength and comfort, highlighting the lifestyle and spirit of this limited series. The Aventador 780-4 Ultimae Roadster stirs emotions that are intense, uncompromised and enduring throughout time. The interior of this open-top limited series superbly combines sportiness and elegance. The fine and skillfully crafted materials, including carbon fiber for the main finishes and Alcantara® laser-cut with the Y motif for the upholstery, afford a touch of absolute sophistication to the luxurious passenger compartment. The Roadster presents a unique combination of performance, comfort and refinement. A carbon fiber plate bears the number of examples made, commemorating the special nature of this exclusive model. A range of brand-new Ad Personam combinations further enhances the Aventador LP 780-4 Ultimae Roadster.",
        "year": 2022,
        "price": 1600000,
        "available": true
    },
    {
        "brand": "Rolls-Royce",
        "brandLogo": "https://listcarbrands.com/wp-content/uploads/2016/03/Rolls-Royce-Logo-960x540.png",
        "model": "Rolls-Royce Wraith",
        "modelImage": "https://www.kimballstock.com/pix/car/p/06/aut-51-rk0095-01p.jpg",
        "description":"As the most powerful Rolls-Royce, the 2015 Wraith accelerates with authority and belies its heavy curb weight with an as-tested 0-60 mph time of 4.1 seconds, allowing it to hang with many performance cars in a straight line. The Wraith's handling, however, isn't up to the same standard as cars that prioritize driving dynamics, making a better cruiser than canyon carver. Ride quality remains typical Rolls-Royce, with the car gliding smoothly and quickly on the highway. The interior is as opulent as one expects in a car that has a starting price of over $200,000, and Rolls-Royce allows buyers to personalize their cars by offering an array of interior and exterior color combinations, upholsteries, veneers, and alloy wheels.",
        "year": 2015,
        "price": 155000,
        "available": true
    },
    {
        "brand": "Porsche",
        "brandLogo": "https://listcarbrands.com/wp-content/uploads/2015/09/Porsche-logo-768x415.jpg",
        "model": "Porsche 911 GT3 RS White",
        "modelImage": "https://www.kimballstock.com/pix/car/p/07/por-04-rk1045-01p.jpg",
        "description":"The new 911 GT3 RS has a maximum overall downforce of 860 kilograms at 285 km/h. Porsche Active Aerodynamics (PAA) is the basis for the enormous increase in downforce. The system includes continuously adjustable wing elements on the front side and on the rear wing in two sections. A DRS (Drag Reduction System) is installed for the first time in a production Porsche. Promoting reduced aerodynamic drag and higher speed on straight sections, the DRS system allows the ailerons to be positioned flat within a defined area at the touch of a button. Thanks to a wide range of measures aimed at making the structure lighter, the 911 GT3 RS in its lightest version weighs just 1,450 kilograms (unladen weight according to DIN). For example, the doors, front fenders, roof and front and rear bumpers are made of carbon fiber reinforced plastic (CFRP). CFRP is also used in interiors. The high-performance 4-liter naturally aspirated engine has been further optimized compared to the 911 GT3. The increase in output to 386 kW (525 hp) is achieved primarily via new camshafts with modified cam profiles. The single-throttle intake system and the rigid valve trains also come from motorsports. The seven-speed Porsche Doppelkupplung (PDK) features a reduced gear ratio compared to the 911 GT3. The 911 GT3 RS accelerates from 0 to 100 km/h in 3.2 seconds and in seventh gear reaches a top speed of 296 km/h.",
        "year": 2023,
        "price": 242000,
        "available": false
    },
    {
        "brand": "Porsche",
        "brandLogo": "https://listcarbrands.com/wp-content/uploads/2015/09/Porsche-logo-768x415.jpg",
        "model": "Porsche 911 GT3 RS Green",
        "modelImage": "https://www.kimballstock.com/pix/car/p/07/por-04-rk0749-02p.jpg",
        "description":"The new 911 GT3 RS has a maximum overall downforce of 860 kilograms at 285 km/h. Porsche Active Aerodynamics (PAA) is the basis for the enormous increase in downforce. The system includes continuously adjustable wing elements on the front side and on the rear wing in two sections. A DRS (Drag Reduction System) is installed for the first time in a production Porsche. Promoting reduced aerodynamic drag and higher speed on straight sections, the DRS system allows the ailerons to be positioned flat within a defined area at the touch of a button. Thanks to a wide range of measures aimed at making the structure lighter, the 911 GT3 RS in its lightest version weighs just 1,450 kilograms (unladen weight according to DIN). For example, the doors, front fenders, roof and front and rear bumpers are made of carbon fiber reinforced plastic (CFRP). CFRP is also used in interiors. The high-performance 4-liter naturally aspirated engine has been further optimized compared to the 911 GT3. The increase in output to 386 kW (525 hp) is achieved primarily via new camshafts with modified cam profiles. The single-throttle intake system and the rigid valve trains also come from motorsports. The seven-speed Porsche Doppelkupplung (PDK) features a reduced gear ratio compared to the 911 GT3. The 911 GT3 RS accelerates from 0 to 100 km/h in 3.2 seconds and in seventh gear reaches a top speed of 296 km/h.",
        "year": 2007,
        "price": 189900,
        "available": false
    },
    {
        "brand": "Porsche",
        "brandLogo": "https://listcarbrands.com/wp-content/uploads/2015/09/Porsche-logo-768x415.jpg",
        "model": "Porsche 911 GT3 RS Red",
        "modelImage": "https://www.kimballstock.com/pix/car/p/07/por-04-rk1010-01p.jpg",
        "description":"The new 911 GT3 RS has a maximum overall downforce of 860 kilograms at 285 km/h. Porsche Active Aerodynamics (PAA) is the basis for the enormous increase in downforce. The system includes continuously adjustable wing elements on the front side and on the rear wing in two sections. A DRS (Drag Reduction System) is installed for the first time in a production Porsche. Promoting reduced aerodynamic drag and higher speed on straight sections, the DRS system allows the ailerons to be positioned flat within a defined area at the touch of a button. Thanks to a wide range of measures aimed at making the structure lighter, the 911 GT3 RS in its lightest version weighs just 1,450 kilograms (unladen weight according to DIN). For example, the doors, front fenders, roof and front and rear bumpers are made of carbon fiber reinforced plastic (CFRP). CFRP is also used in interiors. The high-performance 4-liter naturally aspirated engine has been further optimized compared to the 911 GT3. The increase in output to 386 kW (525 hp) is achieved primarily via new camshafts with modified cam profiles. The single-throttle intake system and the rigid valve trains also come from motorsports. The seven-speed Porsche Doppelkupplung (PDK) features a reduced gear ratio compared to the 911 GT3. The 911 GT3 RS accelerates from 0 to 100 km/h in 3.2 seconds and in seventh gear reaches a top speed of 296 km/h.",
        "year": 2016,
        "price": 185000,
        "available": true
    },
    {
        "brand": "Rolls-Royce",
        "brandLogo": "https://listcarbrands.com/wp-content/uploads/2016/03/Rolls-Royce-Logo-960x540.png",
        "model": "Rolls Royce Phantom Silver",
        "modelImage": "https://www.kimballstock.com/pix/car/p/05/aut-42-rk0238-01p.jpg",
        "description":"This was a limited run (25 units) of the Rolls-Royce Phantom commemorating the 100th anniversary of the Rolls-Royce Silver Ghost. It included a Metallic Ghost Silver body colour, 21-inch wheels with chrome centres, solid silver Spirit of Ecstasy, Rose Leaf or Crème Light leather upholstery, seat piping and headrests embroidered with the Rolls-Royce interlinked RR badge, straight-grained Santos Palissander wood veneer, Coolbox, Santos Palissander veneer presentation box with key, two solid silver key fobs and a specially commissioned solid silver Conway Stewart fountain pen; bespoke drinks holder, white instrument dials, bespoke clock matched to instrument dials, Phantom Silver tread plates",
        "year": 2007,
        "price": 470000,
        "available": true
    }
]